/*

//  해당 코드는 콘솔에서 입력 받기 위한 코드이다.

    import java.util.Scanner;

    Scanner sc = new Scanner(System.in);
    int num = sc.nextInt();

//  1. 두 정수 A와 B가 주어졌을 때, A와 B를 비교하는 프로그램을 작성하시오.

        입력
        첫째 줄에 A와 B가 주어진다. A와 B는 공백 한 칸으로 구분되어져 있다.

        출력
        첫째 줄에 다음 세 가지 중 하나를 출력한다.

        A가 B보다 큰 경우에는 '>'를 출력한다.
        A가 B보다 작은 경우에는 '<'를 출력한다.
        A와 B가 같은 경우에는 '=='를 출력한다.

//  2. 연도가 주어졌을 때, 윤년이면 1, 아니면 0을 출력하는 프로그램을 작성하시오.

        윤년은 연도가 4의 배수이면서, 100의 배수가 아닐 때 또는 400의 배수일 때이다.

        예를 들어, 2012년은 4의 배수이면서 100의 배수가 아니라서 윤년이다. 1900년은 100의 배수이고 400의 배수는 아니기 때문에 윤년이 아니다. 하지만, 2000년은 400의 배수이기 때문에 윤년이다.

        입력
        첫째 줄에 연도가 주어진다. 연도는 1보다 크거나 같고, 4000보다 작거나 같은 자연수이다.

        출력
        첫째 줄에 윤년이면 1, 아니면 0을 출력한다.

//  3. 구구단을 출력하는 프로그램을 작성해보세요

    예시)
        2 * 1 = 2
        2 * 2 = 4
            .
            .
            .
        9 * 8 = 72
        9 * 9 = 81

//  4. 첫째 줄에는 별 1개, 둘째 줄에는 별 2개, N번째 줄에는 별 N개를 찍는 문제

    하지만, 오른쪽을 기준으로 정렬한 별(예제 참고)을 출력하시오.

    입력
    첫째 줄에 N(1 ≤ N ≤ 100)이 주어진다.

    출력
    첫째 줄부터 N번째 줄까지 차례대로 별을 출력한다.

    에시 )
        *
       **
      ***
     ****
    *****


//  5. 숫자 하나를 입력 받아 3의 배수를 제외한 수를 합한 값을 구하는 코드를 작성해보세요.

    예)  20 = 127
         100 = 3267

//  6. 두 정수 A와 B를 입력받은 다음, A+B를 출력하는 프로그램을 작성하시오. ( while문 작성 요망 )

    입력
    입력은 여러 개의 테스트 케이스로 이루어져 있다.

    각 테스트 케이스는 한 줄로 이루어져 있으며, 각 줄에 A와 B가 주어진다. (0 < A, B < 10)

    입력의 마지막에는 0 두 개가 들어온다.

    출력
    각 테스트 케이스마다 A+B를 출력한다.

    입력 예제
    1 1
    2 3
    3 4
    9 8
    5 2
    0 0

    출력 예제
    2
    5
    7
    17
    7
*/


public class Practice02 {


}
